#!usr/bin/env python3
# -*- coding: utf-8 -*-

from bs4 import BeautifulSoup
import urllib.request
import lxml
import re
import datetime
import sys
import random
import pymysql

theday = str(datetime.datetime.now().strftime("%Y-%m-%d"))
db = pymysql.connect(host="localhost", user="root", passwd="yip", db="suumo", charset="utf8")
cursor = db.cursor()
check_urls_query = "SELECT url FROM listings;"
cursor.execute(check_urls_query)
db_urls = [item[0] for item in list(cursor.fetchall())]

def main():

    baseurl = "http://suumo.jp/chintai/tokyo/new/pnz1.html"
    
    resp = urllib.request.urlopen(baseurl)
    
    soup = BeautifulSoup(resp, 'lxml')
    
    maxpage = soup.find('a', href=re.compile('pnz[0-9]{4}')).text
    
    for i in range(int(maxpage), 1, -1):
        
        #print("Now scraping {} out of {}.\n".format(i, maxpage))
 
        url = "http://suumo.jp/chintai/tokyo/new/pnz1{}.html".format(i)
        
        #print(url)

        try:
            
            resp = urllib.request.urlopen(url)
        
        except :

            pass

        linkurls = []
        
        soup = BeautifulSoup(resp, 'lxml')
        
        links = soup.find_all('a')
        
        for link in links:
        
            if str(link.text) == '詳細を見る' and link.get('href') not in linkurls:
            
                linkurls.append(link.get('href'))

        for url in linkurls:
            
            #print("Now trying {}.\n".format(url))
            
            try:
                
                listing_page_scraper(url)

            except:

                pass

def listing_page_scraper(url):
    
    resp = urllib.request.urlopen(url)

    soup = BeautifulSoup(resp, 'lxml')

    try:
        rent = float(re.search('[0-9].*(?=万)', soup.find('span', attrs={'class':'detailvalue-item-accent'}).text).group(0))*10000
    except:
        rent = 0   
    try:
        other_monthly_fees = re.search('[0-9].*[0-9]', soup.find('span', attrs={'class':'detailvalue-item-txt'}).text).group(0)
    except:
        other_monthly_fees = "0"
    try:
        deposit = float(re.search('[0-9].*[0-9]', soup.find('span', attrs={'class':'pct_square detailvalue-txt-icon'}, text='敷').next_element.next_element.next_element.string).group(0)) * 10000
    except:    
        deposit = "0"
    try:
        key_money = float(re.search('[0-9].*[0-9]', soup.find('span', attrs={'class':'pct_square detailvalue-txt-icon'}, text='礼').next_element.next_element.next_element.string).group(0)) * 10000    
    except:
        key_money = "0"
    try:
        if re.match('月', soup.find('th', string=re.compile('仲介手数料')).next_element.next_element.next_element.text):    
            agent_comm = float(re.search('[0-9].*[0-9]', soup.find('th', string=re.compile('仲介手数料')).next_element.next_element.next_element.text).group(0)) * float(rent)
        else:
            agent_comm = float(re.search('[0-9].*[0-9]', soup.find('th', string=re.compile('仲介手数料')).next_element.next_element.next_element.text).group(0)) * 10000
    except:
        agent_comm = "0"
    try:
        address = soup.find('td', attrs={'class':'detailinfo-col detailinfo-col--04'}).text.strip().split('\n',1)[0] 
    except:
        address = ""
    try:
        ward = re.search('(?<=都)(.*)(?=区)', address).group(0)
    except:
        ward = ""
    try:
        room_plan = re.search('.*[A-Z]', soup.find('td', attrs={'class':'detailinfo-col detailinfo-col--03'}).text).group(0)
    except:
        try:
            room_plan = re.search('ワンルーム', soup.find('td', attrs={'class':'detailinfo-col detailinfo-col--03'}).text).group(0)
        except:
            room_plan = ""
    try:
        floor_area = re.search('(?<=\n)[0-9]*\.[0-9]+|[0-9]+(?=m)', soup.find('td', attrs={'class':'detailinfo-col detailinfo-col--03'}).text).group(0)
    except:
        floor_area = 0
    try:
        room_age = re.search('[0-9]{1,}', soup.find('div', attrs={'class':'detailvalue-txt'}, string=re.compile('築')).text).group(0)
    except:
        room_age = 0
    try:
        bldg_mat = soup.find('th', string='構造').next_element.next_element.next_element.text.strip()
    except:
        bldg_mat = ""
    try:
        train_line = re.search('(.*)(?=\/)', soup.find('div', attrs={'class':'detailnote-value-list'}).text).group(0) 
    except:
        train_line = ""
    try:
        station = re.search('(?<=\/).*駅', soup.find('div', attrs={'class':'detailnote-value-list'}).text).group(0)
    except:
        station = ""
    try:
        walk_station = re.search('(?<=歩)[0-9]{1,2}(?=分)', [a.text for a in soup.find_all('div', attrs={'class':'detailnote-value-list'}) if not re.search('バス', a.text)][0]).group(0)
    except:
        walk_station = 0
    try:
        tky_dist = tkydistdict.get(station, 0)
    except:
        tky_dist = 0

    scrape_vars = [url, rent, other_monthly_fees, deposit, key_money, agent_comm, address, ward, room_plan, floor_area, room_age, bldg_mat, train_line, station, walk_station, tky_dist, theday]
    sql_vars = [str(i) for i in scrape_vars]
    
    #print scraped listing details
    '''
    print('\n'.join([
        'URL: ' + str(url),
        'Rent: ' + str(rent),
        'Other monthly fees: ' + str(other_monthly_fees),
        'Deposit: ' + str(deposit),
        'Key money: ' + str(key_money),
        'Agent commission: ' + str(agent_comm),
        'Address: ' + str(address),
        'Ward: ' + str(ward),
        'Room plan: ' + str(room_plan),
        'Floor area: ' + str(floor_area) + 'sq.m',
        'Room age: ' + str(room_age) + ' years',
        'Train line: ' + str(train_line),
        'Building material: ' + str(bldg_mat),
        'Closest station: ' + str(station),
        'Walking distance to station: ' + str(walk_station) + ' minutes',
        'Transit distance to Tokyo Station: ' + str(tky_dist) + ' minutes'
        ]
    ))
    '''

    insert_statement = "INSERT INTO listings (url, rent, other_monthly_fees, deposit, key_money, agent_comm, address, ward, room_plan, floor_area, room_age, bldg_mat, train_line, station, walk_station, tky_dist, date_added) VALUES ('{}', {}, {}, {}, {}, {}, '{}', '{}', '{}', {}, {}, '{}', '{}', '{}', {}, {}, '{}');".format(*sql_vars)
    #print(insert_statement+'\n')
    
    if url not in db_urls:
        #print("the first ten urls in db_urls are {}".format(db_urls[:10]))
        #print("inserting {} into the db.".format(url))
        cursor.execute(insert_statement)
        db.commit()
    else:
        #print("skipped {} cuz it was already in the db.".format(url))
        pass

tkydistdict = {
    '相原駅':'59.3',
    '青井駅':'24.183333333333334',
    '青砥駅':'27.183333333333334',
    '青海駅':'14.716666666666667',
    '青物横丁駅':'22.583333333333332',
    '青山一丁目駅':'11.9',
    '赤坂駅':'12.866666666666667',
    '赤坂見附駅':'11.183333333333334',
    '赤土小学校前駅':'23.4',
    '赤羽駅':'26.333333333333332',
    '赤羽岩淵駅':'29.433333333333334',
    '赤羽橋駅':'12.533333333333333',
    '秋川駅':'58.7',
    '昭島駅':'54.53333333333333',
    '秋津駅':'55.35',
    '秋葉原駅':'11.016666666666667',
    '曙橋駅':'17.316666666666666',
    '阿佐ヶ谷駅':'30.066666666666666',
    '浅草駅':'15.55',
    '浅草橋駅':'12.666666666666666',
    '麻布十番駅':'13.083333333333334',
    '飛鳥山駅':'21.016666666666666',
    '足立小台駅':'26.25',
    '穴守稲荷駅':'22.116666666666667',
    '綾瀬駅':'23.033333333333335',
    '新井薬師前駅':'26.4',
    '荒川一中前駅':'18.716666666666665',
    '荒川区役所前駅':'18.4',
    '荒川車庫前駅':'21.0',
    '荒川七丁目駅':'23.416666666666668',
    '荒川二丁目駅':'367.8',
    '荒川遊園地前駅':'23.116666666666667',
    '有明駅':'183.6',
    '有明テニスの森駅':'17.583333333333332',
    '淡路町駅':'8.116666666666667',
    '飯田橋駅':'11.383333333333333',
    '井荻駅':'38.333333333333336',
    '軍畑駅':'84.71666666666667',
    '池上駅':'31.816666666666666',
    '池尻大橋駅':'19.166666666666668',
    '池ノ上駅':'21.2',
    '池袋駅':'18.883333333333333',
    '石川台駅':'27.033333333333335',
    '石神前駅':'82.6',
    '泉体育館駅':'56.4',
    '和泉多摩川駅':'40.38333333333333',
    '板橋駅':'19.883333333333333',
    '板橋区役所前駅':'16.966666666666665',
    '板橋本町駅':'15.016666666666667',
    '市ヶ谷駅':'13.083333333333334',
    '一之江駅':'25.183333333333334',
    '稲城駅':'34.7',
    '稲城長沼駅':'32.15',
    '稲荷町駅':'11.55',
    '井の頭公園駅':'37.6',
    '入谷駅':'11.3',
    '岩本町駅':'11.083333333333334',
    '上野駅':'13.2',
    '上野御徒町駅':'13.033333333333333',
    '上野広小路駅':'15.383333333333333',
    '浮間舟渡駅':'29.65',
    '鶯谷駅':'13.916666666666666',
    '牛込神楽坂駅':'14.633333333333333',
    '牛込柳町駅':'17.216666666666665',
    '牛田駅':'21.2',
    '牛浜駅':'57.56666666666667',
    '内幸町駅':'6.683333333333334',
    '鵜の木駅':'35.1',
    '梅ヶ丘駅':'26.45',
    '梅島駅':'25.083333333333332',
    '梅屋敷駅':'22.366666666666667',
    '永福町駅':'21.433333333333334',
    '江古田駅':'27.633333333333333',
    '越中島駅':'13.983333333333333',
    '江戸川駅':'33.68333333333333',
    '江戸川橋駅':'13.633333333333333',
    '荏原中延駅':'19.866666666666667',
    '荏原町駅':'24.283333333333335',
    '恵比寿駅':'17.716666666666665',
    '扇大橋駅':'22.766666666666666',
    '王子駅':'22.333333333333332',
    '王子駅前駅':'22.05',
    '王子神谷駅':'22.55',
    '青梅駅':'77.73333333333333',
    '青梅街道駅':'58.8',
    '大井競馬場前駅':'19.1',
    '大泉学園駅':'40.31666666666667',
    '大井町駅':'25.15',
    '大岡山駅':'27.133333333333333',
    '大久保駅':'413.98333333333335',
    '大崎駅':'21.066666666666666',
    '大崎広小路駅':'20.15',
    '大島駅':'19.45',
    '大塚駅':'16.983333333333334',
    '大塚駅前駅':'18.4',
    '大塚・帝京大学駅':'47.45',
    '大手町駅':'3.533333333333333',
    '大鳥居駅':'22.183333333333334',
    '大森駅':'21.933333333333334',
    '大森海岸駅':'16.216666666666665',
    '大森町駅':'21.683333333333334',
    '大山駅':'17.216666666666665',
    '御徒町駅':'13.033333333333333',
    '小川駅':'64.2',
    '小川町駅':'76.75',
    '荻窪駅':'32.1',
    '尾久駅':'21.2',
    '奥沢駅':'30.833333333333332',
    '奥多摩駅':'104.8',
    '小作駅':'71.26666666666667',
    '押上駅':'19.333333333333332',
    '小台駅':'26.333333333333332',
    'お台場海浜公園駅':'16.55',
    '恩田駅':'60.0',
    '小田急多摩センター駅':'51.583333333333336',
    '小田急永山駅':'48.46666666666667',
    '落合駅':'24.3',
    '落合南長崎駅':'22.783333333333335',
    '御茶ノ水駅':'10.1',
    '御成門駅':'9.65',
    'お花茶屋駅':'22.6',
    '小村井駅':'22.8',
    '面影橋駅':'17.0',
    '表参道駅':'16.35',
    '尾山台駅':'32.9',
    '御嶽山駅':'31.183333333333334',
    '神楽坂駅':'17.15',
    '葛西駅':'27.566666666666666',
    '葛西臨海公園駅':'17.65',
    '梶原駅':'0',
    '春日駅':'13.516666666666667',
    '霞ヶ関駅':'7.2',
    '片倉駅':'55.88333333333333',
    '勝どき駅':'12.733333333333333',
    '金子駅':'78.0',
    '金町駅':'36.6',
    '要町駅':'17.733333333333334',
    '鐘ヶ淵駅':'18.516666666666666',
    '河辺駅':'75.96666666666667',
    '蒲田駅':'27.716666666666665',
    '上井草駅':'38.93333333333333',
    '上板橋駅':'23.316666666666666',
    '上北沢駅':'24.883333333333333',
    '上北台駅':'63.65',
    '上石神井駅':'42.916666666666664',
    '上中里駅':'22.916666666666668',
    '上野毛駅':'29.45',
    '上町駅':'29.6',
    '神谷町駅':'12.216666666666667',
    '亀有駅':'27.0',
    '亀戸駅':'16.716666666666665',
    '亀戸水神駅':'21.583333333333332',
    '茅場町駅':'8.4',
    '唐木田駅':'54.7',
    '川井駅':'90.71666666666667',
    '神田駅':'6.833333333333333',
    '外苑前駅':'17.883333333333333',
    '学芸大学駅':'26.983333333333334',
    '学習院下駅':'15.7',
    '菊川駅':'17.3',
    '鬼子母神前駅':'15.116666666666667',
    '北赤羽駅':'30.05',
    '北綾瀬駅':'23.466666666666665',
    '北池袋駅':'16.483333333333334',
    '北参道駅':'18.266666666666666',
    '北品川駅':'19.816666666666666',
    '北千住駅':'24.133333333333333',
    '北千束駅':'24.166666666666668',
    '北野駅':'54.483333333333334',
    '北八王子駅':'51.11666666666667',
    '北府中駅':'43.88333333333333',
    '喜多見駅':'38.516666666666666',
    '吉祥寺駅':'36.96666666666667',
    '木場駅':'12.5',
    '競艇場前駅':'35.11666666666667',
    '経堂駅':'28.45',
    '京橋駅':'368.55',
    '清澄白河駅':'13.266666666666667',
    '清瀬駅':'58.88333333333333',
    '清滝駅':'54.75',
    '錦糸町駅':'14.7',
    '銀座駅':'5.6',
    '銀座一丁目駅':'5.333333333333333',
    '久が原駅':'32.96666666666667',
    '久我山駅':'30.366666666666667',
    '九段下駅':'9.1',
    '国立駅':'44.483333333333334',
    '九品仏駅':'32.166666666666664',
    '熊川駅':'56.43333333333333',
    '熊野前駅':'25.55',
    '久米川駅':'65.76666666666667',
    '蔵前駅':'15.983333333333333',
    '京王片倉駅':'56.06666666666667',
    '京王多摩川駅':'34.45',
    '京王多摩センター駅':'54.31666666666667',
    '京王永山駅':'48.46666666666667',
    '京王八王子駅':'51.86666666666667',
    '京王堀之内駅':'54.21666666666667',
    '京王よみうりランド駅':'36.11666666666667',
    '京急蒲田駅':'23.95',
    '京成上野駅':'13.883333333333333',
    '京成金町駅':'33.78333333333333',
    '京成小岩駅':'32.55',
    '京成関屋駅':'19.233333333333334',
    '京成高砂駅':'30.6',
    '京成立石駅':'26.283333333333335',
    '京成曳舟駅':'19.033333333333335',
    '恋ヶ窪駅':'52.05',
    '小岩駅':'30.633333333333333',
    '高円寺駅':'27.2',
    '甲州街道駅':'40.53333333333333',
    '庚申塚駅':'20.366666666666667',
    '麹町駅':'11.366666666666667',
    '糀谷駅':'25.533333333333335',
    '江北駅':'25.883333333333333',
    '高野駅':'24.55',
    '後楽園駅':'13.316666666666666',
    '国際展示場駅':'16.75',
    '国際展示場正門駅':'15.983333333333333',
    '国分寺駅':'51.61666666666667',
    '国立競技場駅':'17.216666666666665',
    '国領駅':'35.733333333333334',
    '小菅駅':'23.466666666666665',
    '小竹向原駅':'22.983333333333334',
    '小平駅':'59.43333333333333',
    '国会議事堂前駅':'10.283333333333333',
    '小伝馬町駅':'9.783333333333333',
    '狛江駅':'38.95',
    '駒込駅':'20.333333333333332',
    '駒沢大学駅':'29.266666666666666',
    '駒場東大前駅':'20.016666666666666',
    '小宮駅':'49.61666666666667',
    '古里駅':'94.11666666666666',
    '是政駅':'37.2',
    '豪徳寺駅':'27.233333333333334',
    '護国寺駅':'13.366666666666667',
    '五反田駅':'17.216666666666665',
    '五反野駅':'23.0',
    '栄町駅':'251.46666666666667',
    '鷺ノ宮駅':'33.61666666666667',
    '桜街道駅':'59.88333333333333',
    '桜新町駅':'25.566666666666666',
    '桜上水駅':'22.233333333333334',
    '桜台駅':'27.016666666666666',
    '桜田門駅':'6.033333333333333',
    '笹塚駅':'17.983333333333334',
    '鮫洲駅':'23.483333333333334',
    '沢井駅':'88.43333333333334',
    '参宮橋駅':'15.233333333333333',
    '三軒茶屋駅':'16.4',
    '椎名町駅':'20.316666666666666',
    '汐留駅':'10.95',
    '潮見駅':'20.116666666666667',
    '市場前駅':'17.066666666666666',
    '品川駅':'20.8',
    '品川シーサイド駅':'18.916666666666668',
    '信濃町駅':'9.7',
    '篠崎駅':'24.816666666666666',
    '東雲駅':'18.566666666666666',
    '芝浦ふ頭駅':'17.516666666666666',
    '芝公園駅':'11.216666666666667',
    '柴崎駅':'38.15',
    '柴崎体育館駅':'44.71666666666667',
    '柴又駅':'34.483333333333334',
    '渋谷駅':'15.116666666666667',
    '志村坂上駅':'20.833333333333332',
    '志村三丁目駅':'22.416666666666668',
    '志茂駅':'25.433333333333334',
    '下赤塚駅':'28.45',
    '下井草駅':'40.03333333333333',
    '下板橋駅':'17.183333333333334',
    '下落合駅':'21.633333333333333',
    '下北沢駅':'23.8',
    '下神明駅':'25.483333333333334',
    '下高井戸駅':'20.583333333333332',
    '下丸子駅':'34.8',
    '石神井公園駅':'38.18333333333333',
    '松陰神社前駅':'24.833333333333332',
    '昭和島駅':'18.65',
    '白糸台駅':'34.63333333333333',
    '白金高輪駅':'17.966666666666665',
    '白金台駅':'17.266666666666666',
    '白丸駅':'99.73333333333333',
    '新秋津駅':'56.35',
    '新板橋駅':'15.633333333333333',
    '新江古田駅':'27.0',
    '新大久保駅':'24.383333333333333',
    '新大塚駅':'14.9',
    '新御徒町駅':'14.2',
    '新御茶ノ水駅':'9.333333333333334',
    '新木場駅':'19.983333333333334',
    '新小岩駅':'23.166666666666668',
    '新高円寺駅':'26.2',
    '新庚申塚駅':'18.383333333333333',
    '新小金井駅':'42.06666666666667',
    '新小平駅':'61.766666666666666',
    '新桜台駅':'24.716666666666665',
    '新柴又駅':'35.31666666666667',
    '新宿駅':'18.133333333333333',
    '新宿御苑前駅':'18.566666666666666',
    '新宿三丁目駅':'22.016666666666666',
    '新宿西口駅':'18.45',
    '新整備場駅':'27.366666666666667',
    '神泉駅':'17.583333333333332',
    '新高島平駅':'25.5',
    '新代田駅':'22.116666666666667',
    '新富町駅':'9.783333333333333',
    '新豊洲駅':'17.483333333333334',
    '新中野駅':'21.7',
    '新日本橋駅':'7.7',
    '新橋駅':'8.683333333333334',
    '新馬場駅':'21.583333333333332',
    '新三河島駅':'21.566666666666666',
    '十条駅':'23.283333333333335',
    '自由が丘駅':'33.8',
    '神保町駅':'9.733333333333333',
    '水天宮前駅':'10.75',
    '水道橋駅':'10.15',
    '末広町駅':'14.066666666666666',
    '巣鴨駅':'20.433333333333334',
    '巣鴨新田駅':'17.4',
    'すずかけ台駅':'43.25',
    '砂川七番駅':'55.85',
    '住吉駅':'13.933333333333334',
    '成城学園前駅':'33.416666666666664',
    '聖蹟桜ヶ丘駅':'44.36666666666667',
    '整備場駅':'19.083333333333332',
    '西武園駅':'68.31666666666666',
    '西武新宿駅':'20.5',
    '西武立川駅':'61.4',
    '西武柳沢駅':'51.56666666666667',
    '西武遊園地駅':'69.86666666666666',
    '世田谷駅':'26.7',
    '世田谷代田駅':'26.083333333333332',
    '千川駅':'22.283333333333335',
    '泉岳寺駅':'21.25',
    '仙川駅':'34.81666666666667',
    '千石駅':'17.133333333333333',
    '千住大橋駅':'21.45',
    '洗足駅':'24.383333333333333',
    '洗足池駅':'24.683333333333334',
    '千駄ヶ谷駅':'10.4',
    '千駄木駅':'21.716666666666665',
    '祖師ヶ谷大蔵駅':'29.966666666666665',
    '雑司が谷駅':'14.95',
    '雑色駅':'28.633333333333333',
    '高井戸駅':'25.566666666666666',
    '高尾駅':'57.516666666666666',
    '高尾山駅':'65.53333333333333',
    '高尾山口駅':'53.86666666666667',
    '高島平駅':'26.966666666666665',
    '高田馬場駅':'19.95',
    '高輪台駅':'19.183333333333334',
    '鷹の台駅':'59.1',
    '高幡不動駅':'43.833333333333336',
    '高松駅':'505.95',
    '宝町駅':'5.333333333333333',
    '滝野川一丁目駅':'18.616666666666667',
    '滝本駅':'90.71666666666667',
    '竹芝駅':'12.466666666666667',
    '竹ノ塚駅':'35.4',
    '竹橋駅':'9.983333333333333',
    '立会川駅':'21.066666666666666',
    '立川駅':'48.65',
    '立川北駅':'50.016666666666666',
    '立川南駅':'47.38333333333333',
    '立飛駅':'56.36666666666667',
    '辰巳駅':'22.083333333333332',
    '田無駅':'53.516666666666666',
    '田端駅':'25.766666666666666',
    '多磨駅':'35.45',
    '多摩川駅':'33.43333333333333',
    '玉川学園前駅':'52.166666666666664',
    '玉川上水駅':'61.766666666666666',
    '多摩境駅':'62.266666666666666',
    '多摩センター駅':'51.233333333333334',
    '田町駅':'16.566666666666666',
    '多摩動物公園駅':'45.6',
    '多磨霊園駅':'36.13333333333333',
    '溜池山王駅':'10.066666666666666',
    '田原町駅':'14.033333333333333',
    '代官山駅':'19.3',
    '大師前駅':'29.116666666666667',
    '代田橋駅':'20.883333333333333',
    '台場駅':'16.3',
    '大門駅':'11.5',
    '地下鉄赤塚駅':'27.7',
    '地下鉄成増駅':'31.716666666666665',
    '千歳烏山駅':'30.016666666666666',
    '千歳船橋駅':'28.533333333333335',
    '千鳥町駅':'31.65',
    '中央大学・明星大学駅':'49.0',
    '調布駅':'33.3',
    '月島駅':'10.383333333333333',
    '築地駅':'9.416666666666666',
    '築地市場駅':'9.933333333333334',
    'つくし野駅':'41.61666666666667',
    'つつじヶ丘駅':'36.65',
    '鶴川駅':'53.1',
    'テレコムセンター駅':'19.583333333333332',
    '天空橋駅':'20.983333333333334',
    '天王洲アイル駅':'17.833333333333332',
    '田園調布駅':'34.95',
    '東京駅':'0.0',
    '東京テレポート駅':'16.65',
    '東大前駅':'16.75',
    '東武練馬駅':'23.833333333333332',
    '東陽町駅':'15.566666666666666',
    'ときわ台駅':'21.866666666666667',
    '戸越駅':'16.683333333333334',
    '戸越銀座駅':'17.483333333333334',
    '戸越公園駅':'22.6',
    '豊島園駅':'32.35',
    '都庁前駅':'14.916666666666666',
    '都電雑司ヶ谷駅':'13.533333333333333',
    '等々力駅':'32.15',
    '舎人駅':'28.2',
    '舎人公園駅':'28.05',
    '飛田給駅':'31.116666666666667',
    '豊洲駅':'15.783333333333333',
    '豊田駅':'48.78333333333333',
    '虎ノ門駅':'9.05',
    '都立家政駅':'33.81666666666667',
    '都立大学駅':'28.383333333333333',
    '中井駅':'21.366666666666667',
    '中板橋駅':'22.35',
    '仲御徒町駅':'9.133333333333333',
    '中神駅':'56.18333333333333',
    '中河原駅':'41.2',
    '中野駅':'27.65',
    '中野坂上駅':'18.633333333333333',
    '中野新橋駅':'22.716666666666665',
    '中野富士見町駅':'23.216666666666665',
    '中延駅':'21.733333333333334',
    '中村橋駅':'35.266666666666666',
    '中目黒駅':'19.033333333333335',
    '永田町駅':'9.533333333333333',
    '長沼駅':'53.4',
    '長原駅':'355.21666666666664',
    '業平橋駅':'0',
    '成増駅':'31.383333333333333',
    '成瀬駅':'46.516666666666666',
    '西新井駅':'27.566666666666666',
    '西新井大師西駅':'28.3',
    '西永福駅':'22.7',
    '西大井駅':'25.633333333333333',
    '西大島駅':'16.733333333333334',
    '西荻窪駅':'34.43333333333333',
    '西葛西駅':'25.016666666666666',
    '西ヶ原駅':'22.066666666666666',
    '西ヶ原四丁目駅':'20.3',
    '西国立駅':'46.666666666666664',
    '西国分寺駅':'49.93333333333333',
    '西小山駅':'24.283333333333335',
    '西新宿駅':'16.866666666666667',
    '西新宿五丁目駅':'17.15',
    '西巣鴨駅':'17.3',
    '西太子堂駅':'20.716666666666665',
    '西高島平駅':'24.283333333333335',
    '西立川駅':'53.18333333333333',
    '西台駅':'23.55',
    '西調布駅':'30.683333333333334',
    '西日暮里駅':'22.483333333333334',
    '西八王子駅':'53.78333333333333',
    '西府駅':'38.1',
    '西馬込駅':'24.816666666666666',
    '西早稲田駅':'18.566666666666666',
    '二重橋前駅':'3.3',
    '日暮里駅':'21.3',
    '日本橋駅':'6.55',
    '人形町駅':'10.083333333333334',
    '沼袋駅':'31.266666666666666',
    '沼部駅':'33.583333333333336',
    '根津駅':'18.666666666666668',
    '練馬駅':'29.966666666666665',
    '練馬春日町駅':'28.883333333333333',
    '練馬高野台駅':'33.55',
    '野方駅':'30.933333333333334',
    '乃木坂駅':'15.0',
    '拝島駅':'53.8',
    '萩山駅':'62.86666666666667',
    '白山駅':'17.5',
    '箱根ヶ崎駅':'65.86666666666666',
    '狭間駅':'61.5',
    '蓮沼駅':'30.616666666666667',
    '蓮根駅':'22.716666666666665',
    '幡ヶ谷駅':'17.616666666666667',
    '旗の台駅':'23.366666666666667',
    '八王子駅':'53.05',
    '八王子みなみ野駅':'58.93333333333333',
    '八幡山駅':'24.766666666666666',
    '八丁堀駅':'6.433333333333334',
    '初台駅':'18.616666666666667',
    '鳩ノ巣駅':'96.73333333333333',
    '花小金井駅':'58.11666666666667',
    '羽田空港国際線ターミナル駅':'25.066666666666666',
    '羽田空港国際線ビル駅':'24.65',
    '羽田空港国内線ターミナル駅':'35.416666666666664',
    '羽田空港第１ビル駅':'23.816666666666666',
    '羽田空港第２ビル駅':'24.116666666666667',
    '浜田山駅':'26.0',
    '浜町駅':'12.233333333333333',
    '浜松町駅':'12.433333333333334',
    '羽村駅':'64.83333333333333',
    '原宿駅':'18.55',
    '半蔵門駅':'10.0',
    '馬喰町駅':'10.416666666666666',
    '馬喰横山駅':'12.483333333333333',
    '光が丘駅':'35.61666666666667',
    '氷川台駅':'28.416666666666668',
    '東秋留駅':'56.266666666666666',
    '東あずま駅':'21.1',
    '東池袋駅':'10.6',
    '東池袋四丁目駅':'0',
    '東青梅駅':'77.26666666666667',
    '東大島駅':'24.433333333333334',
    '東尾久三丁目駅':'25.55',
    '東北沢駅':'20.966666666666665',
    '東銀座駅':'6.45',
    '東久留米駅':'53.35',
    '東高円寺駅':'24.883333333333333',
    '東小金井駅':'43.1',
    '東新宿駅':'22.9',
    '東十条駅':'23.333333333333332',
    '東中神駅':'54.016666666666666',
    '東中野駅':'22.433333333333334',
    '東長崎駅':'27.15',
    '東日本橋駅':'12.716666666666667',
    '東伏見駅':'48.766666666666666',
    '東府中駅':'37.56666666666667',
    '東福生駅':'60.35',
    '東松原駅':'23.6',
    '東向島駅':'19.533333333333335',
    '東村山駅':'66.18333333333334',
    '東大和市駅':'59.46666666666667',
    '曳舟駅':'19.383333333333333',
    '一橋学園駅':'55.5',
    '日向和田駅':'79.21666666666667',
    '日野駅':'44.93333333333333',
    '日の出駅':'13.4',
    'ひばりヶ丘駅':'51.85',
    '日比谷駅':'4.25',
    '平井駅':'23.533333333333335',
    '平山城址公園駅':'51.15',
    '広尾駅':'15.1',
    '富士見ヶ丘駅':'25.016666666666666',
    '富士見台駅':'34.8',
    '二子玉川駅':'31.983333333333334',
    '二俣尾駅':'83.46666666666667',
    '布田駅':'34.71666666666667',
    '府中駅':'41.31666666666667',
    '府中競馬正門前駅':'39.78333333333333',
    '府中本町駅':'42.11666666666667',
    '福生駅':'62.2',
    '不動前駅':'20.716666666666665',
    '船堀駅':'24.733333333333334',
    '船の科学館駅':'17.733333333333334',
    '分倍河原駅':'43.71666666666667',
    '平和島駅':'20.2',
    '平和台駅':'25.683333333333334',
    '方南町駅':'21.35',
    '保谷駅':'44.96666666666667',
    '程久保駅':'42.93333333333333',
    '堀切駅':'20.166666666666668',
    '堀切菖蒲園駅':'20.333333333333332',
    '本駒込駅':'19.233333333333334',
    '本郷三丁目駅':'15.266666666666667',
    '本所吾妻橋駅':'15.216666666666667',
    '馬込駅':'22.483333333333334',
    '町田駅':'49.2',
    '町屋駅':'23.383333333333333',
    '町屋駅前駅':'0',
    '町屋二丁目駅':'373.5833333333333',
    '松が谷駅':'48.28333333333333',
    '松原駅':'25.15',
    '万願寺駅':'37.4',
    '三河島駅':'19.15',
    '瑞江駅':'23.116666666666667',
    '三田駅':'13.683333333333334',
    '三鷹駅':'43.11666666666667',
    '三鷹台駅':'33.46666666666667',
    '御嶽駅':'86.71666666666667',
    '御岳山駅':'90.81666666666666',
    '三越前駅':'8.116666666666667',
    '緑が丘駅':'30.283333333333335',
    '南阿佐ヶ谷駅':'29.65',
    '南大沢駅':'60.05',
    '南新宿駅':'16.866666666666667',
    '南砂町駅':'21.116666666666667',
    '南千住駅':'17.783333333333335',
    '南多摩駅':'34.56666666666667',
    '南平駅':'47.11666666666667',
    '南町田駅':'41.016666666666666',
    '見沼代親水公園駅':'30.983333333333334',
    '三ノ輪駅':'14.6',
    '三ノ輪橋駅':'17.266666666666666',
    '宮の坂駅':'29.05',
    '宮ノ平駅':'79.53333333333333',
    '宮ノ前駅':'0',
    '茗荷谷駅':'15.783333333333333',
    '向原駅':'574.95',
    '武蔵五日市駅':'65.61666666666666',
    '武蔵小金井駅':'45.25',
    '武蔵小山駅':'21.683333333333334',
    '武蔵境駅':'46.38333333333333',
    '武蔵砂川駅':'63.78333333333333',
    '武蔵関駅':'45.3',
    '武蔵新田駅':'32.416666666666664',
    '武蔵野台駅':'34.53333333333333',
    '武蔵引田駅':'59.86666666666667',
    '武蔵増戸駅':'61.7',
    '武蔵大和駅':'70.76666666666667',
    '明治神宮前駅':'18.783333333333335',
    '明大前駅':'20.75',
    '目黒駅':'16.433333333333334',
    '目白駅':'18.133333333333333',
    'めじろ台駅':'60.083333333333336',
    '百草園駅':'41.983333333333334',
    '本蓮沼駅':'18.033333333333335',
    '森下駅':'14.766666666666667',
    '門前仲町駅':'13.166666666666666',
    '矢川駅':'40.233333333333334',
    '矢口渡駅':'31.716666666666665',
    '八坂駅':'68.31666666666666',
    '谷在家駅':'27.166666666666668',
    '矢野口駅':'33.86666666666667',
    '八広駅':'22.583333333333332',
    '谷保駅':'37.6',
    '山下駅':'373.15',
    '山田駅':'355.8833333333333',
    '祐天寺駅':'23.683333333333334',
    '有楽町駅':'2.5833333333333335',
    '雪が谷大塚駅':'27.75',
    '湯島駅':'13.966666666666667',
    '用賀駅':'27.433333333333334',
    '四ツ木駅':'18.616666666666667',
    '四ツ谷駅':'13.483333333333333',
    '四谷三丁目駅':'16.466666666666665',
    '代々木駅':'20.416666666666668',
    '代々木上原駅':'18.483333333333334',
    '代々木公園駅':'14.933333333333334',
    '代々木八幡駅':'14.716666666666667',
    '流通センター駅':'0',
    '両国駅':'15.516666666666667',
    '芦花公園駅':'28.616666666666667',
    '六郷土手駅':'32.0',
    '六町駅':'23.833333333333332',
    '六本木駅':'14.7',
    '六本木一丁目駅':'10.966666666666667',
    '若林駅':'25.333333333333332',

}

if __name__=='__main__':
    main()
